# DocumentValidation Class

---
Utility functions with document validation
SystemObject Autodesk.Revit.DBDocumentValidation
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class DocumentValidation

    Public NotInheritable Class DocumentValidation

    public ref class DocumentValidation abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type DocumentValidation = class end
The DocumentValidation type exposes the following members.
| Name| Description
---|---|---
| CanDeleteElement|  Indicates if an element can be deleted.
Top
#### Reference
Autodesk.Revit.DB Namespace